In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_excel('./tsp_(중구, 24, 6-10).xlsx', sheet_name='k=5')
df

  cluster  number                     tsp route  distance
0       A       7        1, 4, 3, 6, 2, 7, 5, 1  2.902499
1       B       5              1, 2, 3, 4, 5, 1  4.200455
2       C       3                    1, 2, 3, 1  0.983152
3       D       6           1, 2, 5, 6, 4, 3, 1  2.370719
4       E       9  1, 2, 8, 5, 9, 7, 6, 4, 3, 1  4.052855

In [3]:
#n : cluster 내 대여소 갯수
for i in range(len(df)):
    n=df.iloc[i, 1]
    d=df.iloc[i, 3]
    if n>=10:
        비용1=(d/6.8)*1332.74 + 23013.75*4 + 51450000/(16.8*365*2)
        df.loc[i,'truck type']='2.5t'
        df.loc[i, 'cost']=비용1
    else: 
        비용2=(d/8.5)*1332.74 + 23013.75*4 + 18375000/(16.8*365*2)
        df.loc[i,'truck type']='1.0t'
        df.loc[i, 'cost']=비용2
df

,cluster,number,tsp route,distance,truck type,cost
0,A,7,"1, 4, 3, 6, 2, 7, 5, 1",2.902499,1.0t,94008.379054
1,B,5,"1, 2, 3, 4, 5, 1",4.200455,1.0t,94211.889443
2,C,3,"1, 2, 3, 1",0.983152,1.0t,93707.438892
3,D,6,"1, 2, 5, 6, 4, 3, 1",2.370719,1.0t,93924.999648
4,E,9,"1, 2, 8, 5, 9, 7, 6, 4, 3, 1",4.052855,1.0t,94188.746763

In [4]:
#total distance
a=0
for i in range(len(df)):
    a+=df.loc[i, 'distance']
a

14.509680265151928

In [5]:
#total cost
b=0
for i in range(len(df)):
    b+=df.loc[i, 'cost']
b

470041.4538004677